Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM7_mdma.h
#define MDMA_C0CR_SWRQ          (0x1U<<16U)
#define MDMA_C0CR_WEX           (0x1U<<14U)
#define MDMA_C0CR_HEX           (0x1U<<13U)
#define MDMA_C0CR_BEX           (0x1U<<12U)
#define MDMA_C0CR_PL            (0x3U<<6U)
#define MDMA_C0CR_PL_0          (0x1U<<6U)
#define MDMA_C0CR_TCIE          (0x1U<<5U)
#define MDMA_C0CR_BTIE          (0x1U<<4U)
#define MDMA_C0CR_BRTIE         (0x1U<<3U)
#define MDMA_C0CR_CTCIE         (0x1U<<2U)
#define MDMA_C0CR_TEIE          (0x1U<<1U)
#define MDMA_C0CR_EN            (0x1U<<0U)

// C0TCR Configuration

#define MDMA_C0TCR_BWM          (0x1U<<31U)
#define MDMA_C0TCR_SWRM         (0x1U<<30U)
#define MDMA_C0TCR_TRGM         (0x3U<<28U)
#define MDMA_C0TCR_TRGM_0       (0x1U<<28U)
#define MDMA_C0TCR_PAM          (0x3U<<26U)
#define MDMA_C0TCR_PAM_0        (0x1U<<26U)
#define MDMA_C0TCR_PKE          (0x1U<<25U)
#define MDMA_C0TCR_TLEN         (0x7FU<<18U)
#define MDMA_C0TCR_TLEN_0       (0x1U<<18U)
#define MDMA_C0TCR_DBURST       (0x7U<<15U)
#define MDMA_C0TCR_DBURST_0     (0x1U<<15U)
#define MDMA_C0TCR_SBURST       (0x7U<<12U)
#define MDMA_C0TCR_SBURST_0     (0x1U<<12U)
#define MDMA_C0TCR_DINCOS       (0x3U<<10U)
#define MDMA_C0TCR_DINCOS_0     (0x1U<<10U)
#define MDMA_C0TCR_SINCOS       (0x3U<<8U)
#define MDMA_C0TCR_SINCOS_0     (0x1U<<8U)
#define MDMA_C0TCR_DSIZE        (0x3U<<6U)
#define MDMA_C0TCR_DSIZE_0      (0x1U<<6U)
#define MDMA_C0TCR_SSIZE        (0x3U<<4U)
#define MDMA_C0TCR_SSIZE_0      (0x1U<<4U)
#define MDMA_C0TCR_DINC         (0x3U<<2U)
#define MDMA_C0TCR_DINC_0       (0x1U<<2U)
#define MDMA_C0TCR_SINC         (0x3U<<0U)
#define MDMA_C0TCR_SINC_0       (0x1U<<0U)

// C0BNDTR Configuration

#define MDMA_C0BNDTR_BRC        (0xFFFU<<20U)
#define MDMA_C0BNDTR_BRC_0      (0x1U<<20U)
#define MDMA_C0BNDTR_BRDUM      (0x1U<<19U)
#define MDMA_C0BNDTR_BRSUM      (0x1U<<18U)
#define MDMA_C0BNDTR_BNDT       (0x1FFFFU<<0U)
#define MDMA_C0BNDTR_BNDT_0     (0x1U<<0U)

// C0SAR Configuration

#define MDMA_C0SAR_SAR          (0xFFFFFFFFU<<0U)
#define MDMA_C0SAR_SAR_0        (0x1U<<0U)

// C0DAR Configuration

#define MDMA_C0DAR_DAR          (0xFFFFFFFFU<<0U)
#define MDMA_C0DAR_DAR_0        (0x1U<<0U)

// C0BRUR Configuration

#define MDMA_C0BRUR_DUV         (0xFFFFU<<16U)
#define MDMA_C0BRUR_DUV_0       (0x1U<<16U)
#define MDMA_C0BRUR_SUV         (0xFFFFU<<0U)
#define MDMA_C0BRUR_SUV_0       (0x1U<<0U)

// C0LAR Configuration

#define MDMA_C0LAR_LAR          (0xFFFFFFFFU<<0U)
#define MDMA_C0LAR_LAR_0        (0x1U<<0U)

// C0TBR Configuration

#define MDMA_C0TBR_DBUS         (0x1U<<17U)
#define MDMA_C0TBR_SBUS         (0x1U<<16U)
#define MDMA_C0TBR_TSEL         (0x3FU<<0U)
#define MDMA_C0TBR_TSEL_0       (0x1U<<0U)

// C0MAR Configuration

#define MDMA_C0MAR_MAR          (0xFFFFFFFFU<<0U)
#define MDMA_C0MAR_MAR_0        (0x1U<<0U)

// C0MDR Configuration

#define MDMA_C0MDR_MDR          (0xFFFFFFFFU<<0U)
#define MDMA_C0MDR_MDR_0        (0x1U<<0U)

// C1ISR Configuration

#define MDMA_C1ISR_CRQA1        (0x1U<<16U)
#define MDMA_C1ISR_TCIF1        (0x1U<<4U)
#define MDMA_C1ISR_BTIF1        (0x1U<<3U)
#define MDMA_C1ISR_BRTIF1       (0x1U<<2U)
#define MDMA_C1ISR_CTCIF1       (0x1U<<1U)
#define MDMA_C1ISR_TEIF1        (0x1U<<0U)

// C1IFCR Configuration

#define MDMA_C1IFCR_CLTCIF1     (0x1U<<4U)
#define MDMA_C1IFCR_CBTIF1      (0x1U<<3U)
#define MDMA_C1IFCR_CBRTIF1     (0x1U<<2U)
#define MDMA_C1IFCR_CCTCIF1     (0x1U<<1U)
#define MDMA_C1IFCR_CTEIF1      (0x1U<<0U)

// C1ESR Configuration

#define MDMA_C1ESR_BSE          (0x1U<<11U)
#define MDMA_C1ESR_ASE          (0x1U<<10U)
#define MDMA_C1ESR_TEMD         (0x1U<<9U)
#define MDMA_C1ESR_TELD         (0x1U<<8U)
#define MDMA_C1ESR_TED          (0x1U<<7U)
#define MDMA_C1ESR_TEA          (0x7FU<<0U)
#define MDMA_C1ESR_TEA_0        (0x1U<<0U)

// C1CR Configuration

#define MDMA_C1CR_SWRQ          (0x1U<<16U)
#define MDMA_C1CR_WEX           (0x1U<<14U)
#define MDMA_C1CR_HEX           (0x1U<<13U)
#define MDMA_C1CR_BEX           (0x1U<<12U)
#define MDMA_C1CR_PL            (0x3U<<6U)
#define MDMA_C1CR_PL_0          (0x1U<<6U)
#define MDMA_C1CR_TCIE          (0x1U<<5U)
#define MDMA_C1CR_BTIE          (0x1U<<4U)
#define MDMA_C1CR_BRTIE         (0x1U<<3U)
#define MDMA_C1CR_CTCIE         (0x1U<<2U)
#define MDMA_C1CR_TEIE          (0x1U<<1U)
#define MDMA_C1CR_EN            (0x1U<<0U)

// C1TCR Configuration

#define MDMA_C1TCR_BWM          (0x1U<<31U)
#define MDMA_C1TCR_SWRM         (0x1U<<30U)
#define MDMA_C1TCR_TRGM         (0x3U<<28U)
#define MDMA_C1TCR_TRGM_0       (0x1U<<28U)
#define MDMA_C1TCR_PAM          (0x3U<<26U)
#define MDMA_C1TCR_PAM_0        (0x1U<<26U)
#define MDMA_C1TCR_PKE          (0x1U<<25U)
#define MDMA_C1TCR_TLEN         (0x7FU<<18U)
#define MDMA_C1TCR_TLEN_0       (0x1U<<18U)
#define MDMA_C1TCR_DBURST       (0x7U<<15U)
#define MDMA_C1TCR_DBURST_0     (0x1U<<15U)
#define MDMA_C1TCR_SBURST       (0x7U<<12U)
#define MDMA_C1TCR_SBURST_0     (0x1U<<12U)
#define MDMA_C1TCR_DINCOS       (0x3U<<10U)
#define MDMA_C1TCR_DINCOS_0     (0x1U<<10U)
#define MDMA_C1TCR_SINCOS       (0x3U<<8U)
#define MDMA_C1TCR_SINCOS_0     (0x1U<<8U)
#define MDMA_C1TCR_DSIZE        (0x3U<<6U)
#define MDMA_C1TCR_DSIZE_0      (0x1U<<6U)
#define MDMA_C1TCR_SSIZE        (0x3U<<4U)
#define MDMA_C1TCR_SSIZE_0      (0x1U<<4U)
#define MDMA_C1TCR_DINC         (0x3U<<2U)
#define MDMA_C1TCR_DINC_0       (0x1U<<2U)
#define MDMA_C1TCR_SINC         (0x3U<<0U)
#define MDMA_C1TCR_SINC_0       (0x1U<<0U)

// C1BNDTR Configuration

#define MDMA_C1BNDTR_BRC        (0xFFFU<<20U)
#define MDMA_C1BNDTR_BRC_0      (0x1U<<20U)
#define MDMA_C1BNDTR_BRDUM      (0x1U<<19U)
#define MDMA_C1BNDTR_BRSUM      (0x1U<<18U)
#define MDMA_C1BNDTR_BNDT       (0x1FFFFU<<0U)
#define MDMA_C1BNDTR_BNDT_0     (0x1U<<0U)

// C1SAR Configuration

#define MDMA_C1SAR_SAR          (0xFFFFFFFFU<<0U)
#define MDMA_C1SAR_SAR_0        (0x1U<<0U)

// C1DAR Configuration

#define MDMA_C1DAR_DAR          (0xFFFFFFFFU<<0U)
#define MDMA_C1DAR_DAR_0        (0x1U<<0U)

// C1BRUR Configuration

#define MDMA_C1BRUR_DUV         (0xFFFFU<<16U)
#define MDMA_C1BRUR_DUV_0       (0x1U<<16U)
#define MDMA_C1BRUR_SUV         (0xFFFFU<<0U)
#define MDMA_C1BRUR_SUV_0       (0x1U<<0U)

// C1LAR Configuration

#define MDMA_C1LAR_LAR          (0xFFFFFFFFU<<0U)
#define MDMA_C1LAR_LAR_0        (0x1U<<0U)

// C1TBR Configuration

#define MDMA_C1TBR_DBUS         (0x1U<<17U)
#define MDMA_C1TBR_SBUS         (0x1U<<16U)
#define MDMA_C1TBR_TSEL         (0x3FU<<0U)
#define MDMA_C1TBR_TSEL_0       (0x1U<<0U)

