Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM7_mdma.h
// C1MAR Configuration

#define MDMA_C1MAR_MAR          (0xFFFFFFFFU<<0U)
#define MDMA_C1MAR_MAR_0        (0x1U<<0U)

// C1MDR Configuration

#define MDMA_C1MDR_MDR          (0xFFFFFFFFU<<0U)
#define MDMA_C1MDR_MDR_0        (0x1U<<0U)

// C2ISR Configuration

#define MDMA_C2ISR_CRQA2        (0x1U<<16U)
#define MDMA_C2ISR_TCIF2        (0x1U<<4U)
#define MDMA_C2ISR_BTIF2        (0x1U<<3U)
#define MDMA_C2ISR_BRTIF2       (0x1U<<2U)
#define MDMA_C2ISR_CTCIF2       (0x1U<<1U)
#define MDMA_C2ISR_TEIF2        (0x1U<<0U)

// C2IFCR Configuration

#define MDMA_C2IFCR_CLTCIF2     (0x1U<<4U)
#define MDMA_C2IFCR_CBTIF2      (0x1U<<3U)
#define MDMA_C2IFCR_CBRTIF2     (0x1U<<2U)
#define MDMA_C2IFCR_CCTCIF2     (0x1U<<1U)
#define MDMA_C2IFCR_CTEIF2      (0x1U<<0U)

// C2ESR Configuration

#define MDMA_C2ESR_BSE          (0x1U<<11U)
#define MDMA_C2ESR_ASE          (0x1U<<10U)
#define MDMA_C2ESR_TEMD         (0x1U<<9U)
#define MDMA_C2ESR_TELD         (0x1U<<8U)
#define MDMA_C2ESR_TED          (0x1U<<7U)
#define MDMA_C2ESR_TEA          (0x7FU<<0U)
#define MDMA_C2ESR_TEA_0        (0x1U<<0U)

// C2CR Configuration

#define MDMA_C2CR_SWRQ          (0x1U<<16U)
#define MDMA_C2CR_WEX           (0x1U<<14U)
#define MDMA_C2CR_HEX           (0x1U<<13U)
#define MDMA_C2CR_BEX           (0x1U<<12U)
#define MDMA_C2CR_PL            (0x3U<<6U)
#define MDMA_C2CR_PL_0          (0x1U<<6U)
#define MDMA_C2CR_TCIE          (0x1U<<5U)
#define MDMA_C2CR_BTIE          (0x1U<<4U)
#define MDMA_C2CR_BRTIE         (0x1U<<3U)
#define MDMA_C2CR_CTCIE         (0x1U<<2U)
#define MDMA_C2CR_TEIE          (0x1U<<1U)
#define MDMA_C2CR_EN            (0x1U<<0U)

// C2TCR Configuration

#define MDMA_C2TCR_BWM          (0x1U<<31U)
#define MDMA_C2TCR_SWRM         (0x1U<<30U)
#define MDMA_C2TCR_TRGM         (0x3U<<28U)
#define MDMA_C2TCR_TRGM_0       (0x1U<<28U)
#define MDMA_C2TCR_PAM          (0x3U<<26U)
#define MDMA_C2TCR_PAM_0        (0x1U<<26U)
#define MDMA_C2TCR_PKE          (0x1U<<25U)
#define MDMA_C2TCR_TLEN         (0x7FU<<18U)
#define MDMA_C2TCR_TLEN_0       (0x1U<<18U)
#define MDMA_C2TCR_DBURST       (0x7U<<15U)
#define MDMA_C2TCR_DBURST_0     (0x1U<<15U)
#define MDMA_C2TCR_SBURST       (0x7U<<12U)
#define MDMA_C2TCR_SBURST_0     (0x1U<<12U)
#define MDMA_C2TCR_DINCOS       (0x3U<<10U)
#define MDMA_C2TCR_DINCOS_0     (0x1U<<10U)
#define MDMA_C2TCR_SINCOS       (0x3U<<8U)
#define MDMA_C2TCR_SINCOS_0     (0x1U<<8U)
#define MDMA_C2TCR_DSIZE        (0x3U<<6U)
#define MDMA_C2TCR_DSIZE_0      (0x1U<<6U)
#define MDMA_C2TCR_SSIZE        (0x3U<<4U)
#define MDMA_C2TCR_SSIZE_0      (0x1U<<4U)
#define MDMA_C2TCR_DINC         (0x3U<<2U)
#define MDMA_C2TCR_DINC_0       (0x1U<<2U)
#define MDMA_C2TCR_SINC         (0x3U<<0U)
#define MDMA_C2TCR_SINC_0       (0x1U<<0U)

// C2BNDTR Configuration

#define MDMA_C2BNDTR_BRC        (0xFFFU<<20U)
#define MDMA_C2BNDTR_BRC_0      (0x1U<<20U)
#define MDMA_C2BNDTR_BRDUM      (0x1U<<19U)
#define MDMA_C2BNDTR_BRSUM      (0x1U<<18U)
#define MDMA_C2BNDTR_BNDT       (0x1FFFFU<<0U)
#define MDMA_C2BNDTR_BNDT_0     (0x1U<<0U)

// C2SAR Configuration

#define MDMA_C2SAR_SAR          (0xFFFFFFFFU<<0U)
#define MDMA_C2SAR_SAR_0        (0x1U<<0U)

// C2DAR Configuration

#define MDMA_C2DAR_DAR          (0xFFFFFFFFU<<0U)
#define MDMA_C2DAR_DAR_0        (0x1U<<0U)

// C2BRUR Configuration

#define MDMA_C2BRUR_DUV         (0xFFFFU<<16U)
#define MDMA_C2BRUR_DUV_0       (0x1U<<16U)
#define MDMA_C2BRUR_SUV         (0xFFFFU<<0U)
#define MDMA_C2BRUR_SUV_0       (0x1U<<0U)

// C2LAR Configuration

#define MDMA_C2LAR_LAR          (0xFFFFFFFFU<<0U)
#define MDMA_C2LAR_LAR_0        (0x1U<<0U)

// C2TBR Configuration

#define MDMA_C2TBR_DBUS         (0x1U<<17U)
#define MDMA_C2TBR_SBUS         (0x1U<<16U)
#define MDMA_C2TBR_TSEL         (0x3FU<<0U)
#define MDMA_C2TBR_TSEL_0       (0x1U<<0U)

// C2MAR Configuration

#define MDMA_C2MAR_MAR          (0xFFFFFFFFU<<0U)
#define MDMA_C2MAR_MAR_0        (0x1U<<0U)

// C2MDR Configuration

#define MDMA_C2MDR_MDR          (0xFFFFFFFFU<<0U)
#define MDMA_C2MDR_MDR_0        (0x1U<<0U)

// C3ISR Configuration

#define MDMA_C3ISR_CRQA3        (0x1U<<16U)
#define MDMA_C3ISR_TCIF3        (0x1U<<4U)
#define MDMA_C3ISR_BTIF3        (0x1U<<3U)
#define MDMA_C3ISR_BRTIF3       (0x1U<<2U)
#define MDMA_C3ISR_CTCIF3       (0x1U<<1U)
#define MDMA_C3ISR_TEIF3        (0x1U<<0U)

// C3IFCR Configuration

#define MDMA_C3IFCR_CLTCIF3     (0x1U<<4U)
#define MDMA_C3IFCR_CBTIF3      (0x1U<<3U)
#define MDMA_C3IFCR_CBRTIF3     (0x1U<<2U)
#define MDMA_C3IFCR_CCTCIF3     (0x1U<<1U)
#define MDMA_C3IFCR_CTEIF3      (0x1U<<0U)

// C3ESR Configuration

#define MDMA_C3ESR_BSE          (0x1U<<11U)
#define MDMA_C3ESR_ASE          (0x1U<<10U)
#define MDMA_C3ESR_TEMD         (0x1U<<9U)
#define MDMA_C3ESR_TELD         (0x1U<<8U)
#define MDMA_C3ESR_TED          (0x1U<<7U)
#define MDMA_C3ESR_TEA          (0x7FU<<0U)
#define MDMA_C3ESR_TEA_0        (0x1U<<0U)

// C3CR Configuration

#define MDMA_C3CR_SWRQ          (0x1U<<16U)
#define MDMA_C3CR_WEX           (0x1U<<14U)
#define MDMA_C3CR_HEX           (0x1U<<13U)
#define MDMA_C3CR_BEX           (0x1U<<12U)
#define MDMA_C3CR_PL            (0x3U<<6U)
#define MDMA_C3CR_PL_0          (0x1U<<6U)
#define MDMA_C3CR_TCIE          (0x1U<<5U)
#define MDMA_C3CR_BTIE          (0x1U<<4U)
#define MDMA_C3CR_BRTIE         (0x1U<<3U)
#define MDMA_C3CR_CTCIE         (0x1U<<2U)
#define MDMA_C3CR_TEIE          (0x1U<<1U)
#define MDMA_C3CR_EN            (0x1U<<0U)

// C3TCR Configuration

#define MDMA_C3TCR_BWM          (0x1U<<31U)
#define MDMA_C3TCR_SWRM         (0x1U<<30U)
#define MDMA_C3TCR_TRGM         (0x3U<<28U)
#define MDMA_C3TCR_TRGM_0       (0x1U<<28U)
#define MDMA_C3TCR_PAM          (0x3U<<26U)
#define MDMA_C3TCR_PAM_0        (0x1U<<26U)
#define MDMA_C3TCR_PKE          (0x1U<<25U)
#define MDMA_C3TCR_TLEN         (0x7FU<<18U)
#define MDMA_C3TCR_TLEN_0       (0x1U<<18U)
#define MDMA_C3TCR_DBURST       (0x7U<<15U)
#define MDMA_C3TCR_DBURST_0     (0x1U<<15U)
#define MDMA_C3TCR_SBURST       (0x7U<<12U)
#define MDMA_C3TCR_SBURST_0     (0x1U<<12U)
#define MDMA_C3TCR_DINCOS       (0x3U<<10U)
#define MDMA_C3TCR_DINCOS_0     (0x1U<<10U)
#define MDMA_C3TCR_SINCOS       (0x3U<<8U)
#define MDMA_C3TCR_SINCOS_0     (0x1U<<8U)
#define MDMA_C3TCR_DSIZE        (0x3U<<6U)
#define MDMA_C3TCR_DSIZE_0      (0x1U<<6U)
#define MDMA_C3TCR_SSIZE        (0x3U<<4U)
#define MDMA_C3TCR_SSIZE_0      (0x1U<<4U)
#define MDMA_C3TCR_DINC         (0x3U<<2U)
#define MDMA_C3TCR_DINC_0       (0x1U<<2U)
#define MDMA_C3TCR_SINC         (0x3U<<0U)
#define MDMA_C3TCR_SINC_0       (0x1U<<0U)

// C3BNDTR Configuration

