Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM7_mdma.h
// C5BNDTR Configuration

#define MDMA_C5BNDTR_BRC        (0xFFFU<<20U)
#define MDMA_C5BNDTR_BRC_0      (0x1U<<20U)
#define MDMA_C5BNDTR_BRDUM      (0x1U<<19U)
#define MDMA_C5BNDTR_BRSUM      (0x1U<<18U)
#define MDMA_C5BNDTR_BNDT       (0x1FFFFU<<0U)
#define MDMA_C5BNDTR_BNDT_0     (0x1U<<0U)

// C5SAR Configuration

#define MDMA_C5SAR_SAR          (0xFFFFFFFFU<<0U)
#define MDMA_C5SAR_SAR_0        (0x1U<<0U)

// C5DAR Configuration

#define MDMA_C5DAR_DAR          (0xFFFFFFFFU<<0U)
#define MDMA_C5DAR_DAR_0        (0x1U<<0U)

// C5BRUR Configuration

#define MDMA_C5BRUR_DUV         (0xFFFFU<<16U)
#define MDMA_C5BRUR_DUV_0       (0x1U<<16U)
#define MDMA_C5BRUR_SUV         (0xFFFFU<<0U)
#define MDMA_C5BRUR_SUV_0       (0x1U<<0U)

// C5LAR Configuration

#define MDMA_C5LAR_LAR          (0xFFFFFFFFU<<0U)
#define MDMA_C5LAR_LAR_0        (0x1U<<0U)

// C5TBR Configuration

#define MDMA_C5TBR_DBUS         (0x1U<<17U)
#define MDMA_C5TBR_SBUS         (0x1U<<16U)
#define MDMA_C5TBR_TSEL         (0x3FU<<0U)
#define MDMA_C5TBR_TSEL_0       (0x1U<<0U)

// C5MAR Configuration

#define MDMA_C5MAR_MAR          (0xFFFFFFFFU<<0U)
#define MDMA_C5MAR_MAR_0        (0x1U<<0U)

// C5MDR Configuration

#define MDMA_C5MDR_MDR          (0xFFFFFFFFU<<0U)
#define MDMA_C5MDR_MDR_0        (0x1U<<0U)

// C6ISR Configuration

#define MDMA_C6ISR_CRQA6        (0x1U<<16U)
#define MDMA_C6ISR_TCIF6        (0x1U<<4U)
#define MDMA_C6ISR_BTIF6        (0x1U<<3U)
#define MDMA_C6ISR_BRTIF6       (0x1U<<2U)
#define MDMA_C6ISR_CTCIF6       (0x1U<<1U)
#define MDMA_C6ISR_TEIF6        (0x1U<<0U)

// C6IFCR Configuration

#define MDMA_C6IFCR_CLTCIF6     (0x1U<<4U)
#define MDMA_C6IFCR_CBTIF6      (0x1U<<3U)
#define MDMA_C6IFCR_CBRTIF6     (0x1U<<2U)
#define MDMA_C6IFCR_CCTCIF6     (0x1U<<1U)
#define MDMA_C6IFCR_CTEIF6      (0x1U<<0U)

// C6ESR Configuration

#define MDMA_C6ESR_BSE          (0x1U<<11U)
#define MDMA_C6ESR_ASE          (0x1U<<10U)
#define MDMA_C6ESR_TEMD         (0x1U<<9U)
#define MDMA_C6ESR_TELD         (0x1U<<8U)
#define MDMA_C6ESR_TED          (0x1U<<7U)
#define MDMA_C6ESR_TEA          (0x7FU<<0U)
#define MDMA_C6ESR_TEA_0        (0x1U<<0U)

// C6CR Configuration

#define MDMA_C6CR_SWRQ          (0x1U<<16U)
#define MDMA_C6CR_WEX           (0x1U<<14U)
#define MDMA_C6CR_HEX           (0x1U<<13U)
#define MDMA_C6CR_BEX           (0x1U<<12U)
#define MDMA_C6CR_PL            (0x3U<<6U)
#define MDMA_C6CR_PL_0          (0x1U<<6U)
#define MDMA_C6CR_TCIE          (0x1U<<5U)
#define MDMA_C6CR_BTIE          (0x1U<<4U)
#define MDMA_C6CR_BRTIE         (0x1U<<3U)
#define MDMA_C6CR_CTCIE         (0x1U<<2U)
#define MDMA_C6CR_TEIE          (0x1U<<1U)
#define MDMA_C6CR_EN            (0x1U<<0U)

// C6TCR Configuration

#define MDMA_C6TCR_BWM          (0x1U<<31U)
#define MDMA_C6TCR_SWRM         (0x1U<<30U)
#define MDMA_C6TCR_TRGM         (0x3U<<28U)
#define MDMA_C6TCR_TRGM_0       (0x1U<<28U)
#define MDMA_C6TCR_PAM          (0x3U<<26U)
#define MDMA_C6TCR_PAM_0        (0x1U<<26U)
#define MDMA_C6TCR_PKE          (0x1U<<25U)
#define MDMA_C6TCR_TLEN         (0x7FU<<18U)
#define MDMA_C6TCR_TLEN_0       (0x1U<<18U)
#define MDMA_C6TCR_DBURST       (0x7U<<15U)
#define MDMA_C6TCR_DBURST_0     (0x1U<<15U)
#define MDMA_C6TCR_SBURST       (0x7U<<12U)
#define MDMA_C6TCR_SBURST_0     (0x1U<<12U)
#define MDMA_C6TCR_DINCOS       (0x3U<<10U)
#define MDMA_C6TCR_DINCOS_0     (0x1U<<10U)
#define MDMA_C6TCR_SINCOS       (0x3U<<8U)
#define MDMA_C6TCR_SINCOS_0     (0x1U<<8U)
#define MDMA_C6TCR_DSIZE        (0x3U<<6U)
#define MDMA_C6TCR_DSIZE_0      (0x1U<<6U)
#define MDMA_C6TCR_SSIZE        (0x3U<<4U)
#define MDMA_C6TCR_SSIZE_0      (0x1U<<4U)
#define MDMA_C6TCR_DINC         (0x3U<<2U)
#define MDMA_C6TCR_DINC_0       (0x1U<<2U)
#define MDMA_C6TCR_SINC         (0x3U<<0U)
#define MDMA_C6TCR_SINC_0       (0x1U<<0U)

// C6BNDTR Configuration

#define MDMA_C6BNDTR_BRC        (0xFFFU<<20U)
#define MDMA_C6BNDTR_BRC_0      (0x1U<<20U)
#define MDMA_C6BNDTR_BRDUM      (0x1U<<19U)
#define MDMA_C6BNDTR_BRSUM      (0x1U<<18U)
#define MDMA_C6BNDTR_BNDT       (0x1FFFFU<<0U)
#define MDMA_C6BNDTR_BNDT_0     (0x1U<<0U)

// C6SAR Configuration

#define MDMA_C6SAR_SAR          (0xFFFFFFFFU<<0U)
#define MDMA_C6SAR_SAR_0        (0x1U<<0U)

// C6DAR Configuration

#define MDMA_C6DAR_DAR          (0xFFFFFFFFU<<0U)
#define MDMA_C6DAR_DAR_0        (0x1U<<0U)

// C6BRUR Configuration

#define MDMA_C6BRUR_DUV         (0xFFFFU<<16U)
#define MDMA_C6BRUR_DUV_0       (0x1U<<16U)
#define MDMA_C6BRUR_SUV         (0xFFFFU<<0U)
#define MDMA_C6BRUR_SUV_0       (0x1U<<0U)

// C6LAR Configuration

#define MDMA_C6LAR_LAR          (0xFFFFFFFFU<<0U)
#define MDMA_C6LAR_LAR_0        (0x1U<<0U)

// C6TBR Configuration

#define MDMA_C6TBR_DBUS         (0x1U<<17U)
#define MDMA_C6TBR_SBUS         (0x1U<<16U)
#define MDMA_C6TBR_TSEL         (0x3FU<<0U)
#define MDMA_C6TBR_TSEL_0       (0x1U<<0U)

// C6MAR Configuration

#define MDMA_C6MAR_MAR          (0xFFFFFFFFU<<0U)
#define MDMA_C6MAR_MAR_0        (0x1U<<0U)

// C6MDR Configuration

#define MDMA_C6MDR_MDR          (0xFFFFFFFFU<<0U)
#define MDMA_C6MDR_MDR_0        (0x1U<<0U)

// C7ISR Configuration

#define MDMA_C7ISR_CRQA7        (0x1U<<16U)
#define MDMA_C7ISR_TCIF7        (0x1U<<4U)
#define MDMA_C7ISR_BTIF7        (0x1U<<3U)
#define MDMA_C7ISR_BRTIF7       (0x1U<<2U)
#define MDMA_C7ISR_CTCIF7       (0x1U<<1U)
#define MDMA_C7ISR_TEIF7        (0x1U<<0U)

// C7IFCR Configuration

#define MDMA_C7IFCR_CLTCIF7     (0x1U<<4U)
#define MDMA_C7IFCR_CBTIF7      (0x1U<<3U)
#define MDMA_C7IFCR_CBRTIF7     (0x1U<<2U)
#define MDMA_C7IFCR_CCTCIF7     (0x1U<<1U)
#define MDMA_C7IFCR_CTEIF7      (0x1U<<0U)

// C7ESR Configuration

#define MDMA_C7ESR_BSE          (0x1U<<11U)
#define MDMA_C7ESR_ASE          (0x1U<<10U)
#define MDMA_C7ESR_TEMD         (0x1U<<9U)
#define MDMA_C7ESR_TELD         (0x1U<<8U)
#define MDMA_C7ESR_TED          (0x1U<<7U)
#define MDMA_C7ESR_TEA          (0x7FU<<0U)
#define MDMA_C7ESR_TEA_0        (0x1U<<0U)

// C7CR Configuration

#define MDMA_C7CR_SWRQ          (0x1U<<16U)
#define MDMA_C7CR_WEX           (0x1U<<14U)
#define MDMA_C7CR_HEX           (0x1U<<13U)
#define MDMA_C7CR_BEX           (0x1U<<12U)
#define MDMA_C7CR_PL            (0x3U<<6U)
#define MDMA_C7CR_PL_0          (0x1U<<6U)
#define MDMA_C7CR_TCIE          (0x1U<<5U)
#define MDMA_C7CR_BTIE          (0x1U<<4U)
#define MDMA_C7CR_BRTIE         (0x1U<<3U)
#define MDMA_C7CR_CTCIE         (0x1U<<2U)
#define MDMA_C7CR_TEIE          (0x1U<<1U)
#define MDMA_C7CR_EN            (0x1U<<0U)

// C7TCR Configuration

#define MDMA_C7TCR_BWM          (0x1U<<31U)
#define MDMA_C7TCR_SWRM         (0x1U<<30U)
#define MDMA_C7TCR_TRGM         (0x3U<<28U)
#define MDMA_C7TCR_TRGM_0       (0x1U<<28U)
#define MDMA_C7TCR_PAM          (0x3U<<26U)
#define MDMA_C7TCR_PAM_0        (0x1U<<26U)
#define MDMA_C7TCR_PKE          (0x1U<<25U)
#define MDMA_C7TCR_TLEN         (0x7FU<<18U)
#define MDMA_C7TCR_TLEN_0       (0x1U<<18U)
#define MDMA_C7TCR_DBURST       (0x7U<<15U)
#define MDMA_C7TCR_DBURST_0     (0x1U<<15U)
#define MDMA_C7TCR_SBURST       (0x7U<<12U)
#define MDMA_C7TCR_SBURST_0     (0x1U<<12U)
#define MDMA_C7TCR_DINCOS       (0x3U<<10U)
#define MDMA_C7TCR_DINCOS_0     (0x1U<<10U)
#define MDMA_C7TCR_SINCOS       (0x3U<<8U)
#define MDMA_C7TCR_SINCOS_0     (0x1U<<8U)
#define MDMA_C7TCR_DSIZE        (0x3U<<6U)
#define MDMA_C7TCR_DSIZE_0      (0x1U<<6U)
#define MDMA_C7TCR_SSIZE        (0x3U<<4U)
#define MDMA_C7TCR_SSIZE_0      (0x1U<<4U)
#define MDMA_C7TCR_DINC         (0x3U<<2U)
#define MDMA_C7TCR_DINC_0       (0x1U<<2U)
#define MDMA_C7TCR_SINC         (0x3U<<0U)
#define MDMA_C7TCR_SINC_0       (0x1U<<0U)

