Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM7_mdma.h
// C7BNDTR Configuration

#define MDMA_C7BNDTR_BRC        (0xFFFU<<20U)
#define MDMA_C7BNDTR_BRC_0      (0x1U<<20U)
#define MDMA_C7BNDTR_BRDUM      (0x1U<<19U)
#define MDMA_C7BNDTR_BRSUM      (0x1U<<18U)
#define MDMA_C7BNDTR_BNDT       (0x1FFFFU<<0U)
#define MDMA_C7BNDTR_BNDT_0     (0x1U<<0U)

// C7SAR Configuration

#define MDMA_C7SAR_SAR          (0xFFFFFFFFU<<0U)
#define MDMA_C7SAR_SAR_0        (0x1U<<0U)

// C7DAR Configuration

#define MDMA_C7DAR_DAR          (0xFFFFFFFFU<<0U)
#define MDMA_C7DAR_DAR_0        (0x1U<<0U)

// C7BRUR Configuration

#define MDMA_C7BRUR_DUV         (0xFFFFU<<16U)
#define MDMA_C7BRUR_DUV_0       (0x1U<<16U)
#define MDMA_C7BRUR_SUV         (0xFFFFU<<0U)
#define MDMA_C7BRUR_SUV_0       (0x1U<<0U)

// C7LAR Configuration

#define MDMA_C7LAR_LAR          (0xFFFFFFFFU<<0U)
#define MDMA_C7LAR_LAR_0        (0x1U<<0U)

// C7TBR Configuration

#define MDMA_C7TBR_DBUS         (0x1U<<17U)
#define MDMA_C7TBR_SBUS         (0x1U<<16U)
#define MDMA_C7TBR_TSEL         (0x3FU<<0U)
#define MDMA_C7TBR_TSEL_0       (0x1U<<0U)

// C7MAR Configuration

#define MDMA_C7MAR_MAR          (0xFFFFFFFFU<<0U)
#define MDMA_C7MAR_MAR_0        (0x1U<<0U)

// C7MDR Configuration

#define MDMA_C7MDR_MDR          (0xFFFFFFFFU<<0U)
#define MDMA_C7MDR_MDR_0        (0x1U<<0U)

// C8ISR Configuration

#define MDMA_C8ISR_CRQA8        (0x1U<<16U)
#define MDMA_C8ISR_TCIF8        (0x1U<<4U)
#define MDMA_C8ISR_BTIF8        (0x1U<<3U)
#define MDMA_C8ISR_BRTIF8       (0x1U<<2U)
#define MDMA_C8ISR_CTCIF8       (0x1U<<1U)
#define MDMA_C8ISR_TEIF8        (0x1U<<0U)

// C8IFCR Configuration

#define MDMA_C8IFCR_CLTCIF8     (0x1U<<4U)
#define MDMA_C8IFCR_CBTIF8      (0x1U<<3U)
#define MDMA_C8IFCR_CBRTIF8     (0x1U<<2U)
#define MDMA_C8IFCR_CCTCIF8     (0x1U<<1U)
#define MDMA_C8IFCR_CTEIF8      (0x1U<<0U)

// C8ESR Configuration

#define MDMA_C8ESR_BSE          (0x1U<<11U)
#define MDMA_C8ESR_ASE          (0x1U<<10U)
#define MDMA_C8ESR_TEMD         (0x1U<<9U)
#define MDMA_C8ESR_TELD         (0x1U<<8U)
#define MDMA_C8ESR_TED          (0x1U<<7U)
#define MDMA_C8ESR_TEA          (0x7FU<<0U)
#define MDMA_C8ESR_TEA_0        (0x1U<<0U)

// C8CR Configuration

#define MDMA_C8CR_SWRQ          (0x1U<<16U)
#define MDMA_C8CR_WEX           (0x1U<<14U)
#define MDMA_C8CR_HEX           (0x1U<<13U)
#define MDMA_C8CR_BEX           (0x1U<<12U)
#define MDMA_C8CR_PL            (0x3U<<6U)
#define MDMA_C8CR_PL_0          (0x1U<<6U)
#define MDMA_C8CR_TCIE          (0x1U<<5U)
#define MDMA_C8CR_BTIE          (0x1U<<4U)
#define MDMA_C8CR_BRTIE         (0x1U<<3U)
#define MDMA_C8CR_CTCIE         (0x1U<<2U)
#define MDMA_C8CR_TEIE          (0x1U<<1U)
#define MDMA_C8CR_EN            (0x1U<<0U)

// C8TCR Configuration

#define MDMA_C8TCR_BWM          (0x1U<<31U)
#define MDMA_C8TCR_SWRM         (0x1U<<30U)
#define MDMA_C8TCR_TRGM         (0x3U<<28U)
#define MDMA_C8TCR_TRGM_0       (0x1U<<28U)
#define MDMA_C8TCR_PAM          (0x3U<<26U)
#define MDMA_C8TCR_PAM_0        (0x1U<<26U)
#define MDMA_C8TCR_PKE          (0x1U<<25U)
#define MDMA_C8TCR_TLEN         (0x7FU<<18U)
#define MDMA_C8TCR_TLEN_0       (0x1U<<18U)
#define MDMA_C8TCR_DBURST       (0x7U<<15U)
#define MDMA_C8TCR_DBURST_0     (0x1U<<15U)
#define MDMA_C8TCR_SBURST       (0x7U<<12U)
#define MDMA_C8TCR_SBURST_0     (0x1U<<12U)
#define MDMA_C8TCR_DINCOS       (0x3U<<10U)
#define MDMA_C8TCR_DINCOS_0     (0x1U<<10U)
#define MDMA_C8TCR_SINCOS       (0x3U<<8U)
#define MDMA_C8TCR_SINCOS_0     (0x1U<<8U)
#define MDMA_C8TCR_DSIZE        (0x3U<<6U)
#define MDMA_C8TCR_DSIZE_0      (0x1U<<6U)
#define MDMA_C8TCR_SSIZE        (0x3U<<4U)
#define MDMA_C8TCR_SSIZE_0      (0x1U<<4U)
#define MDMA_C8TCR_DINC         (0x3U<<2U)
#define MDMA_C8TCR_DINC_0       (0x1U<<2U)
#define MDMA_C8TCR_SINC         (0x3U<<0U)
#define MDMA_C8TCR_SINC_0       (0x1U<<0U)

// C8BNDTR Configuration

#define MDMA_C8BNDTR_BRC        (0xFFFU<<20U)
#define MDMA_C8BNDTR_BRC_0      (0x1U<<20U)
#define MDMA_C8BNDTR_BRDUM      (0x1U<<19U)
#define MDMA_C8BNDTR_BRSUM      (0x1U<<18U)
#define MDMA_C8BNDTR_BNDT       (0x1FFFFU<<0U)
#define MDMA_C8BNDTR_BNDT_0     (0x1U<<0U)

// C8SAR Configuration

#define MDMA_C8SAR_SAR          (0xFFFFFFFFU<<0U)
#define MDMA_C8SAR_SAR_0        (0x1U<<0U)

// C8DAR Configuration

#define MDMA_C8DAR_DAR          (0xFFFFFFFFU<<0U)
#define MDMA_C8DAR_DAR_0        (0x1U<<0U)

// C8BRUR Configuration

#define MDMA_C8BRUR_DUV         (0xFFFFU<<16U)
#define MDMA_C8BRUR_DUV_0       (0x1U<<16U)
#define MDMA_C8BRUR_SUV         (0xFFFFU<<0U)
#define MDMA_C8BRUR_SUV_0       (0x1U<<0U)

// C8LAR Configuration

#define MDMA_C8LAR_LAR          (0xFFFFFFFFU<<0U)
#define MDMA_C8LAR_LAR_0        (0x1U<<0U)

// C8TBR Configuration

#define MDMA_C8TBR_DBUS         (0x1U<<17U)
#define MDMA_C8TBR_SBUS         (0x1U<<16U)
#define MDMA_C8TBR_TSEL         (0x3FU<<0U)
#define MDMA_C8TBR_TSEL_0       (0x1U<<0U)

// C8MAR Configuration

#define MDMA_C8MAR_MAR          (0xFFFFFFFFU<<0U)
#define MDMA_C8MAR_MAR_0        (0x1U<<0U)

// C8MDR Configuration

#define MDMA_C8MDR_MDR          (0xFFFFFFFFU<<0U)
#define MDMA_C8MDR_MDR_0        (0x1U<<0U)

// C9ISR Configuration

#define MDMA_C9ISR_CRQA9        (0x1U<<16U)
#define MDMA_C9ISR_TCIF9        (0x1U<<4U)
#define MDMA_C9ISR_BTIF9        (0x1U<<3U)
#define MDMA_C9ISR_BRTIF9       (0x1U<<2U)
#define MDMA_C9ISR_CTCIF9       (0x1U<<1U)
#define MDMA_C9ISR_TEIF9        (0x1U<<0U)

// C9IFCR Configuration

#define MDMA_C9IFCR_CLTCIF9     (0x1U<<4U)
#define MDMA_C9IFCR_CBTIF9      (0x1U<<3U)
#define MDMA_C9IFCR_CBRTIF9     (0x1U<<2U)
#define MDMA_C9IFCR_CCTCIF9     (0x1U<<1U)
#define MDMA_C9IFCR_CTEIF9      (0x1U<<0U)

// C9ESR Configuration

#define MDMA_C9ESR_BSE          (0x1U<<11U)
#define MDMA_C9ESR_ASE          (0x1U<<10U)
#define MDMA_C9ESR_TEMD         (0x1U<<9U)
#define MDMA_C9ESR_TELD         (0x1U<<8U)
#define MDMA_C9ESR_TED          (0x1U<<7U)
#define MDMA_C9ESR_TEA          (0x7FU<<0U)
#define MDMA_C9ESR_TEA_0        (0x1U<<0U)

// C9CR Configuration

#define MDMA_C9CR_SWRQ          (0x1U<<16U)
#define MDMA_C9CR_WEX           (0x1U<<14U)
#define MDMA_C9CR_HEX           (0x1U<<13U)
#define MDMA_C9CR_BEX           (0x1U<<12U)
#define MDMA_C9CR_PL            (0x3U<<6U)
#define MDMA_C9CR_PL_0          (0x1U<<6U)
#define MDMA_C9CR_TCIE          (0x1U<<5U)
#define MDMA_C9CR_BTIE          (0x1U<<4U)
#define MDMA_C9CR_BRTIE         (0x1U<<3U)
#define MDMA_C9CR_CTCIE         (0x1U<<2U)
#define MDMA_C9CR_TEIE          (0x1U<<1U)
#define MDMA_C9CR_EN            (0x1U<<0U)

// C9TCR Configuration

#define MDMA_C9TCR_BWM          (0x1U<<31U)
#define MDMA_C9TCR_SWRM         (0x1U<<30U)
#define MDMA_C9TCR_TRGM         (0x3U<<28U)
#define MDMA_C9TCR_TRGM_0       (0x1U<<28U)
#define MDMA_C9TCR_PAM          (0x3U<<26U)
#define MDMA_C9TCR_PAM_0        (0x1U<<26U)
#define MDMA_C9TCR_PKE          (0x1U<<25U)
#define MDMA_C9TCR_TLEN         (0x7FU<<18U)
#define MDMA_C9TCR_TLEN_0       (0x1U<<18U)
#define MDMA_C9TCR_DBURST       (0x7U<<15U)
#define MDMA_C9TCR_DBURST_0     (0x1U<<15U)
#define MDMA_C9TCR_SBURST       (0x7U<<12U)
#define MDMA_C9TCR_SBURST_0     (0x1U<<12U)
#define MDMA_C9TCR_DINCOS       (0x3U<<10U)
#define MDMA_C9TCR_DINCOS_0     (0x1U<<10U)
#define MDMA_C9TCR_SINCOS       (0x3U<<8U)
#define MDMA_C9TCR_SINCOS_0     (0x1U<<8U)
#define MDMA_C9TCR_DSIZE        (0x3U<<6U)
#define MDMA_C9TCR_DSIZE_0      (0x1U<<6U)
#define MDMA_C9TCR_SSIZE        (0x3U<<4U)
#define MDMA_C9TCR_SSIZE_0      (0x1U<<4U)
#define MDMA_C9TCR_DINC         (0x3U<<2U)
#define MDMA_C9TCR_DINC_0       (0x1U<<2U)
#define MDMA_C9TCR_SINC         (0x3U<<0U)
#define MDMA_C9TCR_SINC_0       (0x1U<<0U)

// C9BNDTR Configuration

#define MDMA_C9BNDTR_BRC        (0xFFFU<<20U)
#define MDMA_C9BNDTR_BRC_0      (0x1U<<20U)
#define MDMA_C9BNDTR_BRDUM      (0x1U<<19U)
#define MDMA_C9BNDTR_BRSUM      (0x1U<<18U)
#define MDMA_C9BNDTR_BNDT       (0x1FFFFU<<0U)
#define MDMA_C9BNDTR_BNDT_0     (0x1U<<0U)

// C9SAR Configuration

